cf/Documents/Письмо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>Письмо</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Кому</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Текст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетнаяЗапись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипТекста</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыТекстовЭлектронныхПисем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>стрДокументы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>120</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрофильИнтернетПочты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Копия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Вложения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вложение</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Документы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СвязанныеДокументы</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеТоваров</v8:Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваров</v8:Type>
								<v8:Type>cfg:DocumentRef.ВнутреннийЗаказ</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
								<v8:Type>cfg:DocumentRef.ЧекККМ</v8:Type>
								<v8:Type>cfg:DocumentRef.АктСверкиВзаиморасчетов</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
								<v8:Type>cfg:DocumentRef.ИнтернетЗаказПокупателя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КомуСписок</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Кому</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>80</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партнер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КопияСписок</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Кому</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>80</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партнер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf/CommonModules/Почта2Клиент/Ext/Module.bsl
Функция Маскировать(Знач Стр) Экспорт
	
	Стр=СтрЗаменить(Стр,Символы.ПС,"\n");
	Стр=СтрЗаменить(Стр,Символы.ВК,"\r");
	Стр=СтрЗаменить(Стр,"""","\""");
	Стр=СтрЗаменить(Стр,"'","\'");
	Возврат Стр
	  
КонецФункции

Функция ОтправитьПочтовоеСообщениеПочтовомуКлиенту_Ст(ТекстПисьма, Вложения = Неопределено) Экспорт
	
	Почта = Новый Почта;
	Почта.Подключиться();
	
	Сообщение = Новый ПочтовоеСообщение;
	Сообщение.Текст = ТекстПисьма;
	
	Если Вложения <> Неопределено Тогда
		Сообщение.Вложения.Добавить(Вложения); КонецЕсли;
	
	Почта.Послать(ТекстПисьма);
	Почта.Отключиться();
	
КонецФункции

Функция ОтправитьПочтовоеСообщениеПочтовомуКлиенту(Параметры, ИспользоватьОблако = Ложь) Экспорт
	
	Возврат ?(ИспользоватьОблако,
					ОтправитьПочтовоеСообщениеПочтовомуКлиенту_ЧерезОблоко(Параметры),
					ОтправитьПочтовоеСообщениеПочтовомуКлиенту_ЧерезПочту(Параметры));
	
КонецФункции
Функция ОтправитьПочтовоеСообщениеПочтовомуКлиенту_ЧерезОблоко(Параметры) Экспорт
	
	Кому 		= ?(Параметры.Свойство("Кому"), 	Параметры.Кому, "");
	Копия 		= ?(Параметры.Свойство("Копия"), 	Параметры.Копия, "");
	Тема 		= ?(Параметры.Свойство("Тема"), 	Параметры.Тема, "");
	Текст 		= ?(Параметры.Свойство("Текст"), 	Параметры.Текст, "");
	Подпись		= ?(Параметры.Свойство("Подпись"), 	Параметры.Подпись, "");
	
	// Запишем вложения в облоко и дадим ссылки на него
	
	ТекстВложений = "";
	Если Параметры.Свойство("Вложения") Тогда
		
		ТекстВложений 	= Символы.ПС + ?(Параметры.Вложения.Количество() = 1, "Файл:","Прикрепленные файлы:");
		ТекстФайлов 	= "";
		Для Каждого Вложение Из Параметры.Вложения Цикл ТекстФайлов = ТекстФайлов + Символы.ПС + Вложение.ТекстHTML КонецЦикла; 
		ТекстВложений = ТекстВложений + ТекстФайлов; КонецЕсли;
	
	Текст = "mailto:" + Кому + "?subject=" + Тема + "&body=" + Маскировать(Текст + ТекстВложений + Подпись);
	ЗапуститьПриложение(Текст);
	
КонецФункции
Функция ОтправитьПочтовоеСообщениеПочтовомуКлиенту_ЧерезПочту(Параметры) Экспорт
	
	Кому 		= ?(Параметры.Свойство("Кому"), 	Параметры.Кому, 	"");
	Копия 		= ?(Параметры.Свойство("Копия"), 	Параметры.Копия, 	"");
	Тема 		= ?(Параметры.Свойство("Тема"), 	Параметры.Тема, 	"");
	Текст 		= ?(Параметры.Свойство("Текст"), 	Параметры.Текст, 	"");
	Подпись		= ?(Параметры.Свойство("Подпись"), 	Параметры.Подпись, 	"");
	
	// Запишем вложения в облоко и дадим ссылки на него
	
	ТекстВложений = "";
	Если Параметры.Свойство("Вложения") Тогда
		
		ТекстВложений 	= Символы.ПС + ?(Параметры.Вложения.Количество() = 1, "Файл:","Прикрепленные файлы:");
		ТекстФайлов 	= "";
		Для Каждого Вложение Из Параметры.Вложения Цикл ТекстФайлов = ТекстФайлов + Символы.ПС + Вложение.ТекстHTML КонецЦикла; 
		ТекстВложений = ТекстВложений + ТекстФайлов; КонецЕсли;
	
	Текст = "mailto:" + Кому + "?subject=" + Тема + "&body=" + Маскировать(Текст + ТекстВложений + Подпись);
	ЗапуститьПриложение(Текст);
	
КонецФункции

Функция ПроверитьИнтернетПрофиль(ИнтернетПрофиль) Экспорт
	
	Соединение = Новый ИнтернетПочта;
	
	Попытка
		Соединение.Подключиться(ИнтернетПрофиль);
	Исключение
		стрОшибки = ОписаниеОшибки();
		ОбщиеФункции.СообщитьТекст("Ошибка подключения к почтовому серверу
											|" + стрОшибки);
		Возврат Ложь; КонецПопытки;
	
	Соединение.Отключиться();

	Возврат Истина;
	
КонецФункции

Функция ПолучитьИнтернетПрофильПочты(Форма, ДопПараметры = Неопределено)
	
	// Форма 		- откуда вызывается отправка письма
	// ДопПараметры - если в профиль нужно внести какието дополнения 
	//	или переписать существующие параметры интрнет профиля, например пароля
	
	// Получим параметры
	
	Параметры = Почта2Сервер.ПолучитьНастройкиПрофиляПочты();
	
	Если ДопПараметры <> Неопределено Тогда
		КонвертацияТипов.ДобавитьВСтруктуруСтруктуру(Параметры, ДопПараметры) КонецЕсли;
	
	Если Параметры = Неопределено Тогда
		ОбщиеФункции.СообщитьТекст("Ошибка получения настроек соединения с почтовым сервером, необходимо настроить почту и перегрузить программу.");
		Возврат Неопределено; КонецЕсли;
	
	// Создадим профиль
	
	Профиль = Новый ИнтернетПочтовыйПрофиль;
	ЗаполнитьЗначенияСвойств(Профиль, Параметры);
	
	// Введем пароль если он не введен
	
	Если ПустаяСтрока(Параметры.Пароль) Тогда
		ОткрытьФорму("Документ.Письмо.Форма.ВводПароля", Новый Структура(), Форма) КонецЕсли;
	
	// Вернем
	
	Возврат Профиль;
	
КонецФункции

#Область Пароли

Функция ПолучитьПарольИзКеша(ПрофильСсылка, глПаролиНаПочту) Экспорт
	
	Пароль = глПаролиНаПочту[ПрофильСсылка];
	Возврат ?(Пароль = Неопределено, "", Пароль);
	
КонецФункции
Процедура УстановитьПарольВКеше(ПрофильСсылка, Пароль, глПаролиНаПочту) Экспорт
	
	глПаролиНаПочту.Вставить(ПрофильСсылка, Пароль);
	
КонецПроцедуры
Процедура СброситьПарольВКеше(ПрофильСсылка, глПаролиНаПочту) Экспорт
	
	глПаролиНаПочту.Вставить(ПрофильСсылка, Неопределено);
	
КонецПроцедуры

#КонецОбласти
